In [2]:
import pandas as pd
import json
from get_wiki_data import WikiDataLoader

COMPMIX_IR_PATH = "CompMix-IR/kb_wikipedia_mixed_rd.json"
COMPMIX_PATH = "CompMix/train_set.jsonl"

In [3]:
dataloader = WikiDataLoader()
infoboxes, wikitables = dataloader.load_tables(qid="Q493078")

display(len(infoboxes))
display(len(wikitables))

1

40

In [15]:
def read_jsonl(path):
    with open(path, "r", encoding="utf-8") as f:
        qa = f.readlines()
    qa = [json.loads(line) for line in qa]
    return pd.DataFrame(qa)


df = read_jsonl(COMPMIX_PATH)
df.head()

,question_id,question,domain,entities,answers,answer_src,answer_text,convmix_question_id
0,3642,What is the genre of the tv series High Seas?,tvseries,"[{'id': 'Q186424', 'label': 'detective fiction'}]","[{'id': 'Q59591953', 'label': 'High Seas'}]",kb,detective fiction,1236-0
1,2082,What year was M.O.V.E first formed?,music,"[{'id': 'Q285547', 'label': 'Move'}]","[{'id': '1997-01-01T00:00:00Z', 'label': '1997'}]",infobox,1997,694-1
2,4693,What year was the inception of the soccer club...,soccer,"[{'id': 'Q18656', 'label': 'Manchester United ...","[{'id': '1878-01-01T00:00:00Z', 'label': '1878'}]",kb,1878,1588-4
3,2149,Who were the creators of the situation comedy ...,tvseries,"[{'id': 'Q615944', 'label': 'The Mary Tyler Mo...","[{'id': 'Q95125', 'label': 'James L. Brooks'},...",kb,James L. Brooks and Allan Burns,716-2
4,2212,Which country did the TV series Coupling origi...,tvseries,"[{'id': 'Q1137587', 'label': 'Coupling'}]","[{'id': 'Q145', 'label': 'United Kingdom'}]",infobox,United Kingdom,737-0

## 下载table数据

In [2]:
table_path = "CompMix/tableqa_sample.csv"
df = pd.read_csv(table_path)
df.head()

,question_id,question,domain,entities,answers,answer_src,answer_text,convmix_question_id
0,4052,What is Russell Crowe's date of birth?,movies,"[{'id': 'Q129817', 'label': 'Russell Crowe'}]","[{'id': '1964-04-07T00:00:00Z', 'label': '7 Ap...",table,7 April 1964,1372-3
1,1057,Who won the Best Actor award in the Los Angele...,movies,"[{'id': 'Q47221', 'label': 'Taxi Driver'}]","[{'id': 'Q36949', 'label': 'Robert De Niro'}]",table,Robert De Niro,352-2
2,1575,Lin-Manuel Miranda played the role of who in t...,music,"[{'id': 'Q28659892', 'label': 'list of awards ...","[{'id': 'Q178903', 'label': 'Alexander Hamilto...",table,Alexander Hamilton,524-4
3,2992,which date was Emily in Paris season 1 released?,tvseries,"[{'id': 'Q64584978', 'label': 'Emily in Paris'}]","[{'id': '2020-10-02T00:00:00Z', 'label': '2 Oc...",table,"October 2, 2020",1017-0
4,4249,Winner of the 2021 MLS cup?,soccer,"[{'id': 'Q577698', 'label': 'MLS Cup'}]","[{'id': 'Q13361030', 'label': 'New York City F...",table,New York City FC,1439-0

In [3]:
def get_entities(df):
    entities = []
    for _,row in df[0:10].iterrows():
        e = row['entities'].replace("'", '"')
        ej = json.loads(e)
        for entity in ej:
            if entity not in entities:
                entities.append(entity)
    return entities

entities = get_entities(df)
entities[:5]

[{'id': 'Q129817', 'label': 'Russell Crowe'},
 {'id': 'Q47221', 'label': 'Taxi Driver'},
 {'id': 'Q28659892',
  'label': 'list of awards and nominations received by Lin-Manuel Miranda'},
 {'id': 'Q19320959', 'label': 'Hamilton'},
 {'id': 'Q64584978', 'label': 'Emily in Paris'}]

In [ ]:
for entity in entities:
    qid = entity['id']
    dataloader.download_tables(qid)

## 解析text

In [6]:
qid = "Q493078"
page = pd.read_html(dataloader.get_url_from_qid(qid))
for df in page:
    display(df.head())

,0,1
0,"List of the world's billionaires, ranked in or...","List of the world's billionaires, ranked in or..."
1,The net worth of the world's billionaires incr...,The net worth of the world's billionaires incr...
2,Publication details,Publication details
3,Publisher,Whale Media InvestmentsForbes family
4,Publication,Forbes

   Icon                                 Description
0   NaN  Has not changed from the previous ranking.
1   NaN    Has increased from the previous ranking.
2   NaN    Has decreased from the previous ranking.

,No.,Name,Net worth (USD),Age,Nationality,Primary source(s) of wealth
0,1,Bernard Arnault & family,$233 billion,75,France,LVMH
1,2,Elon Musk,$195 billion,52,South Africa Canada United States,"Tesla, SpaceX"
2,3,Jeff Bezos,$194 billion,60,United States,Amazon
3,4,Mark Zuckerberg,$177 billion,39,United States,Meta Platforms
4,5,Larry Ellison,$141 billion,79,United States,Oracle Corporation

,No.,Name,Net worth (USD),Age,Nationality,Primary source(s) of wealth
0,1,Bernard Arnault & family,$211 billion,74,France,LVMH
1,2,Elon Musk,$180 billion,51,South Africa Canada United States,"Tesla, SpaceX"
2,3,Jeff Bezos,$114 billion,59,United States,Amazon
3,4,Larry Ellison,$107 billion,78,United States,Oracle Corporation
4,5,Warren Buffett,$106 billion,92,United States,Berkshire Hathaway

,No.,Name,Net worth (USD),Age,Nationality,Primary source(s) of wealth
0,1,Elon Musk,$219 billion,50,South Africa Canada United States,"Tesla, SpaceX"
1,2,Jeff Bezos,$177 billion,58,United States,Amazon
2,3,Bernard Arnault & family,$158 billion,73,France,LVMH
3,4,Bill Gates,$129 billion,66,United States,Microsoft
4,5,Warren Buffett,$118 billion,91,United States,Berkshire Hathaway

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Jeff Bezos,$177 billion,57,United States,Amazon
1,2,Elon Musk,$151 billion,49,South Africa Canada United States,"Tesla, SpaceX"
2,3,Bernard Arnault & family,$150 billion,72,France,LVMH
3,4,Bill Gates,$124 billion,65,United States,Microsoft
4,5,Mark Zuckerberg,$97 billion,36,United States,Meta Platforms

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Jeff Bezos,$113 billion,56,United States,Amazon
1,2,Bill Gates,$98 billion,64,United States,Microsoft
2,3,Bernard Arnault & family,$76 billion,71,France,LVMH
3,4,Warren Buffett,$67.5 billion,89,United States,Berkshire Hathaway
4,5,Larry Ellison,$59 billion,75,United States,Oracle Corporation

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Jeff Bezos,$131 billion,55,United States,Amazon
1,2,Bill Gates,$96.5 billion,63,United States,Microsoft
2,3,Warren Buffett,$82.5 billion,88,United States,Berkshire Hathaway
3,4,Bernard Arnault,$76 billion,70,France,LVMH
4,5,Carlos Slim,$64 billion,79,Mexico,"América Móvil, Grupo Carso"

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Jeff Bezos,$112 billion,54,United States,Amazon
1,2,Bill Gates,$90 billion,62,United States,Microsoft
2,3,Warren Buffett,$84 billion,87,United States,Berkshire Hathaway
3,4,Bernard Arnault,$72 billion,69,France,LVMH
4,5,Mark Zuckerberg,$71 billion,33,United States,"Facebook, Inc."

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$86.0 billion,61,United States,Microsoft
1,2,Warren Buffett,$75.6 billion,86,United States,Berkshire Hathaway
2,3,Jeff Bezos,$72.8 billion,53,United States,Amazon
3,4,Amancio Ortega,$71.3 billion,80,Spain,"Inditex, Zara"
4,5,Mark Zuckerberg,$56.0 billion,32,United States,"Facebook, Inc."

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$75.0 billion,60,United States,Microsoft
1,2,Amancio Ortega,$67.0 billion,79,Spain,Inditex
2,3,Warren Buffett,$60.8 billion,85,United States,Berkshire Hathaway
3,4,Carlos Slim,$50.0 billion,76,Mexico,"América Móvil, Grupo Carso"
4,5,Jeff Bezos,$45.2 billion,52,United States,Amazon

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$79.2 billion,59,United States,Microsoft
1,2,Carlos Slim,$77.1 billion,75,Mexico,"América Móvil, Grupo Carso"
2,3,Warren Buffett,$72.7 billion,84,United States,Berkshire Hathaway
3,4,Amancio Ortega,$64.5 billion,78,Spain,Inditex
4,5,Larry Ellison,$54.3 billion,70,United States,Oracle Corporation

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$76.0 billion,58,United States,Microsoft
1,2,Carlos Slim & family,$72.0 billion,74,Mexico,"América Móvil, Grupo Carso"
2,3,Amancio Ortega,$64.0 billion,77,Spain,Inditex
3,4,Warren Buffett,$58.2 billion,83,United States,Berkshire Hathaway
4,5,Larry Ellison,$48.0 billion,70,United States,Oracle Corporation

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Carlos Slim & family,$73.0 billion,73,Mexico,"América Móvil, Grupo Carso"
1,2,Bill Gates,$67.0 billion,57,United States,Microsoft
2,3,Amancio Ortega,$57.0 billion,76,Spain,Inditex Group
3,4,Warren Buffett,$53.5 billion,82,United States,Berkshire Hathaway
4,5,Larry Ellison,$43.0 billion,68,United States,Oracle Corporation

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Carlos Slim & family,$69.0 billion,72,Mexico,"América Móvil, Grupo Carso"
1,2,Bill Gates,$61.0 billion,56,United States,Microsoft
2,3,Warren Buffett,$44.0 billion,81,United States,Berkshire Hathaway
3,4,Bernard Arnault,$41.0 billion,63,France,LVMH Moët Hennessy • Louis Vuitton
4,5,Amancio Ortega,$37.5 billion,75,Spain,Inditex Group

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Carlos Slim,$74.0 billion,71,Mexico,"América Móvil, Grupo Carso"
1,2,Bill Gates,$56.0 billion,55,United States,Microsoft
2,3,Warren Buffett,$50.0 billion,80,United States,Berkshire Hathaway
3,4,Bernard Arnault,$41.0 billion,62,France,LVMH Moët Hennessy • Louis Vuitton
4,5,Larry Ellison,$39.5 billion,66,United States,Oracle Corporation

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Carlos Slim & family,$53.5 billion,70,Mexico,"América Móvil, Grupo Carso"
1,2,Bill Gates,$53.0 billion,54,United States,Microsoft
2,3,Warren Buffett,$47.0 billion,79,United States,Berkshire Hathaway
3,4,Mukesh Ambani,$29.0 billion,53,India,Reliance Industries
4,5,Lakshmi Mittal,$28.7 billion,60,India,Arcelor Mittal

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$40.0 billion,53,United States,Microsoft
1,2,Warren Buffett,$37.0 billion,78,United States,Berkshire Hathaway
2,3,Carlos Slim,$35.0 billion,69,Mexico,"América Móvil, Grupo Carso"
3,4,Larry Ellison,$22.5 billion,64,United States,Oracle Corporation
4,5,Ingvar Kamprad,$22.0 billion,83,Sweden,IKEA

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Warren Buffett,$62.0 billion,77,United States,Berkshire Hathaway
1,2,Carlos Slim,$60.0 billion,68,Mexico,"América Móvil, Grupo Carso"
2,3,Bill Gates,$58.0 billion,52,United States,Microsoft
3,4,Lakshmi Mittal,$45.0 billion,57,India,Arcelor Mittal
4,5,Mukesh Ambani,$43.0 billion,51,India,Reliance Industries

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$56.0 billion,51,United States,Microsoft
1,2,Warren Buffett,$52.0 billion,76,United States,Berkshire Hathaway
2,3,Carlos Slim,$49.0 billion,67,Mexico,"América Móvil, Grupo Carso"
3,4,Ingvar Kamprad,$33.0 billion,80,Sweden,IKEA
4,5,Lakshmi Mittal,$32.0 billion,56,India,Arcelor Mittal

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$52.0 billion,50,United States,Microsoft
1,2,Warren Buffett,$42.0 billion,75,United States,Berkshire Hathaway
2,3,Carlos Slim,$30.0 billion,66,Mexico,"América Móvil, Grupo Carso"
3,4,Ingvar Kamprad,$28.0 billion,79,Sweden,IKEA
4,5,Lakshmi Mittal,$23.5 billion,55,India,Mittal Steel Company

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$46.5 billion,49,United States,Microsoft
1,2,Warren Buffett,$44.0 billion,74,United States,Berkshire Hathaway
2,3,Lakshmi Mittal,$25.0 billion,54,India,Mittal Steel Company
3,4,Carlos Slim,$23.8 billion,65,Mexico,"América Móvil, Grupo Carso"
4,5,Al-Waleed bin Talal,$23.7 billion,49,Saudi Arabia,Kingdom Holding Company

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$46.6 billion,48,United States,Microsoft
1,2,Warren Buffett,$42.9 billion,73,United States,Berkshire Hathaway
2,3,Karl Albrecht,$23.0 billion,84,Germany,Aldi Süd
3,4,Al-Waleed bin Talal,$21.5 billion,47,Saudi Arabia,Kingdom Holding Company
4,5,Paul Allen,$21.0 billion,51,United States,Microsoft

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$40.7 billion,47,United States,Microsoft
1,2,Warren Buffett,$30.5 billion,72,United States,Berkshire Hathaway
2,3,Karl and Theo Albrecht,$25.6 billion,83,Germany,Aldi
3,4,Paul Allen,$20.1 billion,50,United States,Microsoft
4,5,Al-Waleed bin Talal,$17.7 billion,46,Saudi Arabia,Kingdom Holding Company

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$52.8 billion,46,United States,Microsoft
1,2,Warren Buffett,$35.0 billion,71,United States,Berkshire Hathaway
2,3,Karl and Theo Albrecht,$26.8 billion,82,Germany,Aldi
3,4,Paul Allen,$25.2 billion,49,United States,Microsoft
4,5,Larry Ellison,$23.5 billion,57,United States,Oracle Corporation

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$58.7 billion,45,United States,Microsoft
1,2,Warren Buffett,$32.3 billion,70,United States,Berkshire Hathaway
2,3,Paul Allen,$30.4 billion,48,United States,Microsoft
3,4,Larry Ellison,$26.0 billion,56,United States,Oracle Corporation
4,5,Karl and Theo Albrecht,$25.0 billion,81,Germany,Aldi

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$60.0 billion,44,United States,Microsoft
1,2,Larry Ellison,$47.0 billion,55,United States,Oracle Corporation
2,3,Paul Allen,$28.0 billion,47,United States,Microsoft
3,4,Warren Buffett,$25.6 billion,69,United States,Berkshire Hathaway
4,5,Karl and Theo Albrecht,$20.0 billion,80,Germany,Aldi

,No.[48],Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$90.0 billion,43,United States,Microsoft
1,2,Warren Buffett,$36.0 billion,68,United States,Berkshire Hathaway
2,3,Paul Allen,$30.0 billion,46,United States,Microsoft
3,4,Steven Ballmer,$19.5 billion,43,United States,Microsoft
4,5,Philip Anschutz,$16.5 billion,59,United States,The Anschutz Corporation

,No.[48],Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$51.0 billion,43,United States,Microsoft
1,2,Walton family,$48.0 billion,_,United States,Wal-Mart
2,3,Warren Buffett,$33.0 billion,67,United States,Berkshire Hathaway
3,4,Paul Allen,$21.0 billion,45,United States,Microsoft
4,5,Kenneth Thomson,$14.4 billion,74,Canada,Woodbridge Co. Ltd.[50]

,No.[48],Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Bill Gates,$36.4 billion,42,United States,Microsoft
1,2,Walton family,$27.6 billion,_,United States,Wal-Mart
2,3,Warren Buffett,$23.2 billion,66,United States,Berkshire Hathaway
3,4,Lee Shau-kee,$14.7 billion,69,Hong Kong,Henderson Land Development[53]
4,5,Paul Allen,$14.1 billion,44,United States,Microsoft

,No.[48],Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Walton family,$22.9 billion,_,United States,Wal-Mart
1,2,Bill Gates,$18.0 billion,41,United States,Microsoft
2,3,Warren Buffett,$15.3 billion,65,United States,Berkshire Hathaway
3,4,"Oeri, Hoffman & Sacher families",$13.1 billion,_,Switzerland,Roche[57]
4,5,Lee Shau-kee,$12.7 billion,68,Hong Kong,Henderson Land Development[53]

,No.[48],Name,Net worth (USD),Nationality,Source(s) of wealth
0,1,Walton family,$23.5 billion,United States,Wal-Mart
1,2,Bill Gates,$12.9 billion,United States,Microsoft
2,3,Warren Buffett,$10.7 billion,United States,Berkshire Hathaway
3,4,Hans and Gad Rausing,$9.0 billion,Sweden,Tetra Pak
4,5,Yoshiaki Tsutsumi,$9.0 billion,Japan,Seibu Corporation

,No.[48],Name,Net worth (USD),Nationality,Source(s) of wealth
0,1,Walton family,$22.6 billion,United States,Wal-Mart
1,2,du Pont family,$9.0 billion,United States,DuPont
2,3,Hans and Gad Rausing,$9.0 billion,Sweden,Tetra Pak
3,4,Yoshiaki Tsutsumi,$8.5 billion,Japan,Seibu Corporation
4,5,Bill Gates,$8.2 billion,United States,Microsoft

,No.[48],Name,Net worth (USD),Nationality,Source(s) of wealth
0,1,Walton family,$25.3 billion,United States,Wal-Mart
1,2,Mars family,$9.2 billion,United States,"Mars, Inc."
2,3,Yoshiaki Tsutsumi,$9.0 billion,Japan,Seibu Corporation
3,4,du Pont family,$8.6 billion,United States,DuPont
4,5,Minoru and Akira Mori,$7.5 billion,Japan,Mori Building Company

,No.[48],Name,Net worth (USD),Nationality,Source(s) of wealth
0,1,Walton family,$23.8 billion,United States,Wal-Mart
1,2,Taikichiro Mori,$13.0 billion,Japan,Mori Building Company
2,3,Yoshiaki Tsutsumi,$10.0 billion,Japan,Seibu Corporation
3,4,Hans and Gad Rausing,$7.0 billion,Sweden,Tetra Pak
4,5,Erivan Haub,$6.9 billion,Germany,Tengelmann Group

,No.[48],Name,Net worth (USD),Nationality,Source(s) of wealth
0,1,Walton family,$18.5 billion,United States,Wal-Mart
1,2,Taikichiro Mori,$15.0 billion,Japan,Mori Building Company
2,3,Yoshiaki Tsutsumi,$14.0 billion,Japan,Seibu Corporation
3,4,du Pont family,$10.0 billion,United States,DuPont
4,5,Hans and Gad Rausing,$9.0 billion,Sweden,Tetra Pak

,No.[48],Name,Net worth (USD),Nationality,Source(s) of wealth
0,1,Yoshiaki Tsutsumi,$16.0 billion,Japan,Seibu Corporation
1,2,Taikichiro Mori,$14.6 billion,Japan,Mori Building Company
2,3,Walton family,$13.5 billion,United States,Wal-Mart
3,4,du Pont family,$10.0 billion,United States,DuPont
4,5,Hans and Gad Rausing,$9.6 billion,Sweden,Tetra Pak

,No.[60],Name,Net worth (USD),Nationality,Source(s) of wealth
0,1,Yoshiaki Tsutsumi,$15.0 billion,Japan,Seibu Corporation
1,2,Taikichiro Mori,$14.2 billion,Japan,Mori Building Company
2,3,Sam Walton & family,$8.7 billion,United States,Wal-Mart
3,4,Reichmann brothers,$8.0 billion,Canada,Olympia & York
4,4,Shin Kyuk-ho,$8.0 billion,South Korea,Lotte Corporation

,No.[61],Name,Net worth (USD),Nationality,Source(s) of wealth
0,1,Yoshiaki Tsutsumi,$18.9 billion,Japan,Seibu Corporation
1,2,Taikichiro Mori,$18.0 billion,Japan,Mori Building Company
2,3,Reichmann brothers,$9.0 billion,Canada,Olympia & York
3,4,Shin Kyuk-ho,$8.0 billion,South Korea,Lotte Corporation
4,4,K. C. Irving,$8.0 billion,Canada,Irving Oil

,No.[62],Name,Net worth (USD),Nationality,Source(s) of wealth
0,1,Yoshiaki Tsutsumi,$20 billion,Japan,Seibu Corporation
1,2,Taikichiro Mori,$15 billion,Japan,Mori Building Company
2,3,Shigeru Kobayashi [ja],$7.5 billion,Japan,Shuwa Corporation
3,4,Haruhiko Yoshimoto [ja],$7.0 billion,Japan,Real estate
4,5,Salim Ahmed bin Mahfouz,$6.2 billion,Saudi Arabia,National Commercial Bank

       Year Number of billionaires Group's combined net worth
0   2024[2]                   2781             $14.2 trillion
1   2023[7]                   2640             $12.2 trillion
2   2022[6]                   2668             $12.7 trillion
3  2021[12]                   2755             $13.1 trillion
4      2020                   2095              $8.0 trillion

,vteForbes magazine,vteForbes magazine.1,vteForbes magazine.2
0,Companies,Forbes Global 2000 Forbes 500,NaN
1,People,The World's Billionaires Forbes 400 30 Under 3...,NaN
2,Entertainment,General Forbes Top 40 Celebrity 100 Forbes Fic...,NaN
3,General,Forbes Top 40 Celebrity 100 Forbes Fictional 1...,NaN
4,Fashion,Highest-paid models,NaN

         0                                                  1
0  General  Forbes Top 40 Celebrity 100 Forbes Fictional 1...
1  Fashion                                Highest-paid models
2     Film                                Highest-paid actors
3    Music                             Highest-paid musicians
4    Sport  Highest-paid athletes Most valuable sports tea...

  vteBillionaires                                  vteBillionaires.1
0  By citizenship  Argentina Austria Belgium Brazil Canada Chile ...
1       By region  World Arab League South Asia Southeast Asia Af...
2    Forbes lists  The World's Billionaires 2010 2011 2012 2013 2...
3           Lists  Black Bloomberg Billionaires Index Financial R...
4           Other                             Billionaire space race

,vteExtreme wealth,vteExtreme wealth.1
0,Concepts,Capital accumulation Overaccumulation Economic...
1,Capital accumulation Overaccumulation Economic...,Capital accumulation Overaccumulation Economic...
2,People,Billionaire Captain of industry High-net-worth...
3,Wealth,Concentration Distribution Dynastic Effect Geo...
4,Lists,People Forbes list of billionaires List of cen...

,0,1
0,Capital accumulation Overaccumulation Economic...,Capital accumulation Overaccumulation Economic...
1,People,Billionaire Captain of industry High-net-worth...
2,Wealth,Concentration Distribution Dynastic Effect Geo...

               0                                                  1
0         People  Forbes list of billionaires List of centibilli...
1  Organizations  Largest companies by revenue Largest corporate...
2          Other  Cities by number of billionaires Countries by ...

,0,1
0,Diseases of affluence Affluenza Acquired situa...,Diseases of affluence Affluenza Acquired situa...
1,Philanthropy,Gospel of Wealth The Giving Pledge Philanthroc...
2,Sayings,The rich get richer and the poor get poorer So...
3,Media,Das Kapital Plutus Greek god of wealth Supercl...